Figures built on the graphical ideas of https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf

# CONCAT

In [6]:
import pandas as pd

a_d = {'C1': ['A','B','C'], 'C2': [2.1,4.3,-6.5], 'C3':[23,14,64]}
b_d = {'C1': ['D','E','F'], 'C2': [5.2, 0.5, 7.6], 'C3':[1,144,39]}
c_d = {'C1': ['D','E','F'], 'C2': [5.2, 0.5, 7.6]}
a = pd.DataFrame(a_d)
b = pd.DataFrame(b_d)
c = pd.DataFrame(c_d)

In [7]:
a

  C1   C2  C3
0  A  2.1  23
1  B  4.3  14
2  C -6.5  64

In [8]:
b

  C1   C2   C3
0  D  5.2    1
1  E  0.5  144
2  F  7.6   39

In [9]:
c

  C1   C2
0  D  5.2
1  E  0.5
2  F  7.6

In [10]:
d = pd.concat([a,b])
d

  C1   C2   C3
0  A  2.1   23
1  B  4.3   14
2  C -6.5   64
0  D  5.2    1
1  E  0.5  144
2  F  7.6   39

In [11]:
d.reset_index(inplace=True)
d

   index C1   C2   C3
0      0  A  2.1   23
1      1  B  4.3   14
2      2  C -6.5   64
3      0  D  5.2    1
4      1  E  0.5  144
5      2  F  7.6   39

In [13]:
e = pd.concat([a,c])
e

  C1   C2    C3
0  A  2.1  23.0
1  B  4.3  14.0
2  C -6.5  64.0
0  D  5.2   NaN
1  E  0.5   NaN
2  F  7.6   NaN